// תרגול 3 - 13/11/25

// #1. התחלנו את כתיבת התכנית מפה - מהרטרן והשדות קוסטנטים

// נייבא את ריאקט ואת קובת הcss המתאים בכל קובץ jsx חדש שנפתח.
import React, {useState} from 'react';
import "./TodoList.css"

function TodoList(){
    const [task, setTask] = useState(""); // מחרוזת ריקה בהתחלה
    const [tasks, setTasks] = useState([]); // מערך ריק בהתחלה
    const [index, setIndex] = useState(null); // מספר נאל בהתחלה

    const addTask =()=>{
        // אם יש לנו עכשיו ערך באינדקס זה אומר שמנסים לערוך משימה קיימת אחרת אם זה נאל זה אומר שתהיה משימה חדשה להוספה.
        // נטפל בשני המקרים -
        // הוספה של משימה למערך:
        if (index===null){ // אם האינדקס של המשימה הנוכחית לא קיים ז״א אם היא חדשה (לא נגענו באינדקס בינתיים אם זו משימה ראשונה שמוסיפים או אם לא עדכנו את זה בחזרה לנאל אחרי שינוי או הוספה נוספת (בקוד בהמשך))
            setTasks([...tasks,task]) //אז נוסיף את המשימה למערך
            // כתיב מקוצר - 3 נקודות זה שומר מה שהיה במערך עד עכשיו ומה שאחרי הפסיק זה מה שמוסיף למערך באינדקס האחרון.
        }
        // עריכה של משימה במערך:
        else { // אם יש ערך במשתנה אינדקס (שאגב אנחנו מעדכנים אותו במפה שמציגה את הרשימה (בריטרן), שבתוכה עבור כל איבר (משימה) יש קריאה לפונקציה edittask שמקבלת את האינדקס במפה ומעדכנת את הסטייט שלו (עבור המשימה הנוכחית במערך שלחצו עבורה), ליד כפתור העריכה בשורת המשימה li) - כל זה קורה במקביל בריאקט
            const updateTasks = [...tasks]; //יצירת מערך חדש - העתקה של הקודם
            updateTasks[index] = task // ״עדכון״ (הגדרה מחדש במערך החדש) של המשימה הנוכחית (שגם כן עוברת בשורה li במפה) לפי הסטייט החדש שלה (מה שהוכנס לאינפוט ועדכן את הסטייט), באינדקס הנוכחי המתאים
            setTasks(updateTasks); // עדכון של המערך המקורי לפי המערך החדש עם המשימה המעודכנת
            setIndex(null) // עדכון של האינדקס לנאל אחרי שסיימנו לטפל במשימה הזאת.
        }
        // בסוף: ריקון של מה שיש באינפוט אחרי שסיימנו לערוך או להוסיף משימה!
        setTask("")
    }

    // קריאה מיצירת שורת האיבר במפה שמציגה את הרשימה:
    const editTask =(index)=>{ // המימוש בעצם בכפתור הראשי (כי הוא זה שבתכלס משנה או מוסיף) - במתודה של addtask, למרות שהקריאה מאיברי המפה
        setIndex(index) // כשטקסט של משימה חוזר לאינפוט אז האינדקס מעדכן את הסטייט של אינדקס של המשימה
        setTask(tasks[index]) // ואז מעדכנים את הסטייט של אותה המשימה שבאותו האינדקס במערך
        // עכשיו נוכל לראות את המשימה ברשימה המוצגת בדפדפן מתעדכנת בהתאם לאינפוט החדש
    }

    // קריאה מיצירת שורת האיבר במפה שמציגה את הרשימה:
    const deleteTask =(deleteIndex)=>{
        // פילטור כמו בתכנות דקלרטיבי:
        setTasks(tasks.filter(((task,i) => i !== deleteIndex)))
        //עדכון המערך כך שישמור את המערך המקורי בלי האיבר (המשימה) עם האינדקס ששלחנו שרוצים למחוק.
        // הטעות שהייתה לי - ההשוואה של i האינדקס הנוכחי היא מול האינדקס שרוצים למחוק ששלחנו ולא סתם index (שלו תמיד יהיה הערך של אותה המשימה שכרגע נמצאת באינפוט כשעורכים ולכן מקודם נתן לי רק למחוק משימב כשהיא חוזרת לאינפוט ע״י edit)!!
        setIndex(null)
        // עדכון אחרי ש״מחקנו״ - האינדקס ששמרנו כן קיים במערך אבל עכשיו לא ניגש אליו יותר - שוב נאל.
        // פשוט לא יציג את המשימה יותר כי המערך לא כולל אותה יותר כשרצים על המפה שמציגה את הרשימה.
    }

    return(
        <div>
            <h1>To do List</h1>

            <input // זה מבנה קבוע של אינפוט!
                type={"text"} //  זה הסוג שאנחנו נותנים לו להכנס - כל התווים על המקלדת זה טקסט
                placeholder={"Add a task ..."} // מה שיהיה כתוב בקופסה
                value={task} // לפי הסטייט - חייב להיות סטייט למשתנה משימה הנוכחי!! ככה מקשרים בין האינפוט לסטייט!
                onChange={(e) => setTask(e.target.value)} // כדי שיהיה אפשר באמת להקליד - כל שינוי(e) שנעשה נעדכן לפי setTask
            />
            {/*יהיה לנו כפתור יחיד ליד האינפוט שהכיתוב שלו ישתנה בהתאם*/}
            <button disabled={task.trim()===""} // הכפתור יהיה ליד האינפוט מימין. והבדיקה של טרים בודקת אם אין רווחים ריקים בלי תווים
                    // ז״א אם אין לי טקסט שהוכנס באינפוט (או סתם רווחים ריקים שזה לא נחשב טקסט, אבל היה אפשר גם לעשות לפי אורך===0) אז לא יהיה ניתן לעשות כלום.
                    // הערה: בjs כשיש לנו === זה משווה גם ערך וגם סוג וכשיש לנו == זה משווה רק ערך.
                    //אגב disabled זו תכונה של כפתור שבחלק של {} שמים מתי רוצים שהכפתור לא יהיה לחיץ.
                    onClick={addTask} // תכונה כשנלחץ על הכפתור יפעיל את הפונקציה שתוסיף או תערוך משימה בהתאם לסטייט של אינדקס
            >{index===null?"Add":"Edit"} {/*הכיתוב שיוצג לי על הכפתור לפי העקרון שכתבנו בקובץ app - כביטוי טרנרי*/}
            </button>

            { // מתחת למה שכתבנו עד כה נשים את רשימת המשימות הקיימות שתוצג רק אם היא לא ריקה:
                tasks.length>0 && ( // conditional rendering - אם ריק לא יעשה כלום
                    // ul - רשימה לא ממוספרת
                    <ul>
                        { // עכשיו נגדיר מה יהיה בתוך הרשימה ul:
                            tasks.map((task, index) => // מפה שרצה על כל משימה (סוג האיבר) במערך המשימות לפי הסדר במערך, ובהתאמה לאינדקסים (בשביל מספור)
                                //כל מה שאנחנו רוצים שיוצג בתוך הלולאה עבור כל איבר(יוצג בשורה אחת כל מה שנשים ב-li בכל איבר):
                                <li
                                    key={index}>   {/*המפתח - זה אומר שהמספור הוא ייחודי לפי האינדקס*/}
                                    {task}   {/*המשימה עצמה*/}
                                    <button onClick={()=>editTask(index)}>Edit</button>   {/*כפתור עריכה לפי פונקציה מתאימה*/}
                                    <button onClick={()=>deleteTask(index)}>Delete</button>   {/*כפתור מחיקה לפי פונקציה מתאימה*/}
                                </li>
                            )
                        }
                    </ul>
                )
            }
        </div>
    )
}
export default TodoList;