// 13/11/25
// TO DO LIST
// בניית קומפוננט To Do List מלאה בריאקט

// צרו קומפוננטה בשם TodoList שתאפשר למשתמש:

// 1. להוסיף משימה חדשה לרשימה.

// 2. לערוך משימה קיימת. (ניגש לאינדקס של המשימה במערך המשימות)

//. 3. למחוק משימה קיימת

// 4. להציג את רשימת המשימות אם היא לא ריקה.

// 5. להפוך את כפתור ההוספה ללא פעיל אם לא ההוכנס טקסט.

// במשימה קיימת תהיה אופציה ל2 כפתורים- של עריכה ושל מחיקה.
// ליד משימה שאני עורכת באינפוט - במקום כפתור הוספה ישתנה הכיתוב לכפתור עריכה. (אגב המשימה עדיין תופיע ברשימה למטה).
// כשמשימה נמחקת היא נמחקת מהמערך. כשרוצים לערוך משימה הטקסט שלה חוזר לאינפוט ואז יהיה אפשר ללחוץ ״עריכה״.
// את העריכה הזאת כדי שיחזיר לאינפוט אנחנו נעשה בעזרת האינדקס של המשימה הזאת שנתפוס ונשמור אותו וזה יהיה הווליו (ערך) של האינפוט! ז״א המשימה tasks[index] תהיה הווליו של האינפוט!

// אבל איך בתכלס נשנה את המלל של המשימה עם הכפתור הנכון?
// הריי בסטייט אנחנו כותבים רק מה שחייב ואסור לדוגמה בוליאן שנגזר משדה אחר...
// נדע שצריך לעשות כפתור עריכה כאשר יש לנו אינדקס עבור המשימה שהוא לא נאל (בהתחלה מגדירים את הסטייט של אינדקס כנאל וכשנוספת משימה שומרים במערך וכדי לגשת אליה נשתמש באינדקס הזה במערך ונעדכן את הסטייט של אינדקס).
// אם זו משימה חדשה ז״א אם צריך לעשות הוספה נדע את זה אם האינדקס הוא נאל.

// 6. לשמור את טקסט המשימה שמוזנת ב input

// 7. להשתמש בקובץ CSS חיצוני לעיצוב אלמנטים.

// הקומפוננטה צריכה לכלול:
// state עבור הטקסט של המשימה(task)
// tasks(עבור רשימת המשימות state
// state עבור אינדקס המשימה הנערת(editindex
// פונקציות:
// addTask()
// editTask(index)
// deleteTask(index)
// הציגו את הקומפוננטה בתוך App.jsx

// התחלנו מליצור תיקייה של קומפוננטס בsrc ששם יצרנו את הקובץ jsx והקובץ css עבור הקומפוננטה todolist
// ככה נעשה כל פעם מעכשיו כשאנחנו יודעים שיהיו קומפוננטות. זה חשוב בתכניות גדולות.
// שם של תיקייה מתחיל באות קטנה ושם של קומפוננטה עם אות גדולה.
// עבור כל קומפוננטה שניצור בעתיד ניצור קובץ jsx וקובץ css

import './App.css'
import TodoList from "./components/ToDoList.jsx";
// אגב לשים לב שהשגיאה שהייתה לי שהקוד תקין אבל לא מציג כלום בדפדפן היא כי בטעות כתבתי ידנית לא נכון את שם הקומפוננטה באימפורט - יראה טלטלים ירוקים איפה שקוראים לה בקוד פה.

function App() {

  return (
    <div>
        {// רינדור של הקומפוננטה טו דו ליסט כאן. כדי לעשות את זה לא צריך לייבא כלום
             }
        <TodoList/>
    </div>
  )
}

export default App
